
## Plan Result (fxa-webhook-proxy-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/85331)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9
* Replace
  * aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 must be replaced
+/- resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      ~ created_date  = "2024-03-14T14:59:15Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:996905175585:b1aoz7w8yj/" -> (known after apply)
      ~ id            = "slf4mh" -> (known after apply)
      ~ invoke_url    = "https://b1aoz7w8yj.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "deployedAt"   = "1710428320219" -> "1710428630175"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      ~ deployment_id         = "slf4mh" -> (known after apply)
        id                    = "ags-b1aoz7w8yj-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"08df0536-6263-4610-a33a-317c09ed58e5","JobName":"fxa-webhook-proxy_infrastructure_plan_prod","PRNumber":291,"Program":"tfcmt","SHA1":"01e99ac3c34bc103a03d557efd0735dc87e64816","Target":"fxa-webhook-proxy-cdk","Vars":{}} -->